# OLDTrussSectionDlg

## Description
Show Truss Cross Section dialog.

```pascal
FUNCTION OLDTrussSectionDlg(
				VAR crossSection  : STRING;
				VAR height        : REAL;
				VAR width         : REAL;
				VAR design        : INTEGER;
				VAR chordDiameter : REAL): BOOLEAN;
```

```python
def vs.OLDTrussSectionDlg():
    return (BOOLEAN, crossSection, height, width, design, chordDiameter)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|crossSection|STRING|   |
|height|REAL|   |
|width|REAL|   |
|design|INTEGER|   |
|chordDiameter|REAL|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis